const logger = require('../modules/logger')
try
{
    const enums = {}

    enums.userVariables = [
        'username',
        'password',
        'email',

        'regDate',
        'lastDate',

        'regIP',
        'lastIP',

        'userCreate',
        'choiceRole',

        'position',

        'cash',

        'gender',
        'skin',

        'charname',
        'dateBirth'
    ]

    enums.defaultSpawn = [
        [ 191.79483032226562, -924.42724609375, 30.686996459960938, 140.24330139160156, 0 ],
        [ 207.73556518554688, -936.6594848632812, 30.686809539794922, 147.14170837402344, 0 ],
        [ 201.3427276611328, -946.2774047851562, 30.69178581237793, -33.844200134277344, 0 ],
        [ 186.85000610351562, -934.3627319335938, 30.68680763244629, -35.786529541015625, 0 ]
    ]

    enums.stockX2 = false
    enums.serverName = 'TEST'

    enums.clothesComponentID = {
        mask: 0,
        hair: 2,
        torsos: 3,
        legs: 4,
        bags: 5,
        shoes: 6,
        accessories: 7,
        undershirts: 8,
        armour: 9,
        decals: 10,
        tops: 11
    }
    enums.clothes = {
        'none':
        [
            {
                mask: 0,
                torsos: 15,
                legs: 18,
                bags: 0,
                shoes: 34,
                accessories: 0,
                undershirts: 15,
                armour: 0,
                decals: 0,
                tops: 15
            },
            {
                mask: 0,
                torsos: 15,
                legs: 17,
                bags: 0,
                shoes: 35,
                accessories: 0,
                undershirts: 15,
                armour: 0,
                decals: 0,
                tops: 15
            }
        ]
    }

    enums.roleSpawn =
    [
        [ // Tourist
            [ 2017.0284423828125, 1033.6898193359375, 206.75599670410156, -117.74240112304688, 0 ],
            [ 1795.88916015625, 264.9346008300781, 173.11846923828125, -117.74240112304688, 0 ],
            [ 2425.22216796875, -800.9131469726562, 84.68240356445312, -5.265064716339111, 0 ],
            [ 2409.748291015625, 552.01416015625, 148.36581420898438, -81.38823699951172, 0 ],
            [ 2203.141357421875, 2420.490478515625, 84.46570587158203, -53.565399169921875, 0 ],
            [ 2142.373779296875, 4898.13671875, 39.78801727294922, -53.70864486694336, 0 ],
            [ 95.478271484375, 6966.26123046875, 11.279112815856934, 176.91831970214844, 0 ]
        ],
        [ // Rich
            [ -34.83013153076172, -776.1716918945312, 44.2256965637207, 95.43799591064453, 0 ],
            [ -48.390647888183594, -772.0028076171875, 44.22510528564453, 177.3996124267578, 0 ],
            [ -197.9324493408203, -664.3269653320312, 33.83466720581055, 164.65701293945312, 0 ],
            [ -71.59294128417969, -672.54833984375, 40.72606658935547, -111.13619995117188, 0 ],
            [ -64.6888656616211, -662.3309326171875, 40.72605895996094, -168.2772674560547, 0 ]
        ],
        [ // homeless
            [ 177.7815399169922, -1206.534423828125, 29.29507064819336, -2.262773275375366, 0 ],
            [ 172.36790466308594, -1206.0760498046875, 29.37295913696289, 4.16581392288208, 0 ],
            [ 171.90164184570312, -1201.9412841796875, 29.295093536376953, -177.08937072753906, 0 ],
            [ 175.664794921875, -1201.63525390625, 29.295093536376953, 164.62265014648438, 0 ],
            [ 179.1931915283203, -1197.5267333984375, 29.32306480407715, -3.162309169769287, 0 ],
            [ 175.97207641601562, -1197.857666015625, 29.338716506958008, -24.631040573120117, 0 ],
            [ 171.45452880859375, -1197.288330078125, 29.33945655822754, -5.471336364746094, 0 ]
        ],
    ]

    // { itemHash, itemType, itemName, maxQuantity, data }
    enums.invItems = [
        { itemHash: "tourist_clothes", itemType: "clothes", itemName: "Комплект одежды Туриста", maxQuantity: 1 },
        { itemHash: "rich_clothes", itemType: "clothes", itemName: "Комплект одежды Миллионера", maxQuantity: 1 },
        { itemHash: "homeless_clothes", itemType: "clothes", itemName: "Комплект одежды Бездомного", maxQuantity: 1 }
    ]

    enums.inventory = {}
    enums.inventory.getItem = itemHash =>
    {
        let item
        enums.invItems.forEach(elem =>
        {
            if(elem.itemHash === itemHash) item = elem
        })
        return item
    }

    module.exports = enums
}
catch(e)
{
    logger.error('enums.js', e)
}
